---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.DividedSurfaceCurveChainMultipleSeqIntersWithDivLine
source: html/7fb3c3a4-2a66-a0be-db85-5f1472ecafde.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.DividedSurfaceCurveChainMultipleSeqIntersWithDivLine Property

The chain formed by these curve elements has multiple sequential intersections with a gridline and so the chain will be ignored

## Syntax (C#)
```csharp
public static FailureDefinitionId DividedSurfaceCurveChainMultipleSeqIntersWithDivLine { get; }
```